from aiogram import Router
from aiogram.filters import Command
from aiogram.types import Message

router = Router()

HELP_TEXT = (
    "📌 *Доступные команды:*\n\n"
    "👤 */start* — начать работу\n"
    "ℹ️ */help* — помощь и список команд\n\n"
    "💧 *Вода:*\n"
    "• */log_water 250* — добавить 250 мл воды\n\n"
    "🍽 *Еда:*\n"
    "• */log_food <продукт>* — добавить еду (пример)\n"
    "• */recommend_food <продукт>* — рекомендаци по низкокалорийным вариантам продукта\n\n"
    "🏋️ *Тренировки:*\n"
    "• */log_workout бег 30* — тренировка (пример)\n\n"
    "⚙️ *Профиль:*\n"
    "• */profile* — показать профиль\n"
    "• */set_profile* — настроить профиль\n\n"
    "📒 *Прогресс:*\n"
    "• */check_progress* — записи за сегодня\n"
    "• */graph_water* — график учтенной воды по дням\n"
    "• */graph_calories* — график калорий по дням\n"
    "• */reset_today* — удалить все записи за сегодня"
)

@router.message(Command("help"))
async def cmd_help(message: Message):
    #команда /help - Выводит список доступных команд с описанием
    await message.answer(HELP_TEXT, parse_mode="Markdown")
